UCB_CS61_lec34.org
# -*- org-export-babel-evaluate: nil -*-
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:python :session 第三十四课 排序(三)
#+PROPERTY: header-args:ipython :session 第三十四课 排序(三)
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
#+HTML_HEAD: <script src="https://hypothes.is/embed.js" async></script>
#+HTML_HEAD: <script type="application/json" class="js-hypothesis-config">
#+HTML_HEAD: <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
#+OPTIONS: html-link-use-abs-url:nil html-postamble:nil html-preamble:t
#+OPTIONS: H:3 num:t ^:nil _:nil tags:not-in-toc
#+TITLE: 第三十四课 排序(三)
#+AUTHOR: yiddishkop
#+EMAIL: [[mailto:yiddishkop@163.com][yiddi's email]]
#+TAGS: {PKGIMPT(i) DATAVIEW(v) DATAPREP(p) GRAPHBUILD(b) GRAPHCOMPT(c)} LINAGAPI(a) PROBAPI(b) MATHFORM(f) MLALGO(m)



** SELECTION
Suppose that we want to find the _kth smallest key_ in a list. In other words,
we want to know which item has index j if the list is sorted (where ~j = k -
1~). We could simply sort the list, then look up the item at index j. But if we
don't actually need to sort the list, is there a faster way? This problem is
called _selection_.

One example is finding the median of a set of keys. In an array of n items, we
are looking for the item whose index is ~j = floor(n / 2)~ in the sorted list.

** Quickselect
这里如果不用 quickselect，如果我用 heapsort 去做会如何？
1. heapsort 可以很快的取出最大最小值，so
2. 如果要求 kth largest item from n elements
3. 先初始化一个 heap, 耗时 n
4. 然后取第一个最大值，rebalance heap 耗时 logn
5. 执行上一步 k 次
6. 总计 n + klogn
#+BEGIN_EXAMPLE
[扩展] 其实这里可以把最后复杂度变成：n + klogk
#+END_EXAMPLE
The idea here is that somehow you're going to do this method so that your heap
instead of modifying a heap that has all the elements in it. You're modifying a
heap that has at most K elements in it, where k is biggest that you're looking
for.



#+BEGIN_EXAMPLE
如果采用 quicksort，先排序呢？
毫无疑问，更差一些，排序的时间是 nlogn
#+END_EXAMPLE

We can modify quicksort to perform selection for us. Observe that when we choose
a pivot v and use it to partition the list into three lists I1, Iv, and I2, we
know which of the three lists contains index j, because we know the lengths of
I1 and I2. Therefore, we only need to search one of the three lists.

Here's the quickselect algorithm for finding the item at index j - that is,
having the (j + 1)th smallest key.

#+BEGIN_EXAMPLE
  Start with an unsorted list I of n input items.
  Choose a pivot item v from I.
  Partition I into three unsorted lists I1, Iv, and I2.
    - I1 contains all items whose keys are smaller than v's key.
    - I2 contains all items whose keys are larger than v's.
    - Iv contains the pivot v.
    - Items with the same key as v can go into any of the three lists.
      (In list-based quickselect, they go into Iv; in array-based quickselect,
      they go into I1 and I2, just like in array-based quicksort.)
  if (j < |I1|) {
    Recursively find the item with index j in I1; return it.
  } else if (j < |I1| + |Iv|) {
    Return the pivot v.
  } else {   // j >= |I1| + |Iv|.
    Recursively find the item with index j - |I1| - |Iv| in I2; return it.
  }
#+END_EXAMPLE

  [Attentation] If using *array-based quicksort*, and using this source code
  QuickSortOnArray you should change *[|I1| with i, |Iv| with 1]*, 'i' is
  defined in the src code.

The advantage of quickselect over quicksort is that we only have to make one
recursive call, instead of two. Since we make at most _one_ recursive call at
_every_ level of the recursion tree, quickselect is much faster than quicksort.
I won't analyze quickselect here, but it runs in Theta(n) average time if we
select pivots randomly.

We can easily modify the code for quicksort on arrays, presented in Lecture 31,
to do selection. The partitioning step is done exactly according to the Lecture
31 pseudocode for array quicksort. Recall that when the partitioning stage
finishes, the pivot is stored at index "i" (see the variable "i" in the array
quicksort pseudocode). In the quickselect pseudocode above, just replace ~|I1|
with i and |Iv| with 1~.
