UCB_CS61_lec34.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-09 四 19:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>第三十四课 排序(三)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="yiddishkop" />
<link rel="stylesheet" type="text/css" href="/home/yiddi/git_repos/YIDDI_org_export_theme/theme/org-nav-theme_cache.css" >
</head>
<body>
<div id="content">
<h1 class="title">第三十四课 排序(三)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org65de558">1. SELECTION</a></li>
<li><a href="#orgbdf5b5c">2. Quickselect</a></li>
<li><a href="#org165e803">3. A LOWER BOUND ON COMPARISON-BASED SORTING</a></li>
<li><a href="#org69d8d92">4. LINEAR-TIME SORTING</a></li>
<li><a href="#org0940d98">5. Bucket Sort</a>
<ul>
<li><a href="#org1037746">5.1. Key number I goes into Queue number I.</a></li>
<li><a href="#orgef4905f">5.2. Running time of BucketSort</a></li>
<li><a href="#org08a60a5">5.3. How did we get around the Omega(n log n) lower bound on comparison-based sorting?</a></li>
<li><a href="#orgc9c1d73">5.4. What is a Stable Sort</a></li>
<li><a href="#org1c27c1e">5.5. If q is in O(n), then BucketSort; else, RadixSort</a></li>
</ul>
</li>
</ul>
</div>
</div>



<div id="org65de558" class="outline-2">
<h2 id="org65de558"><span class="section-number-2">1</span> SELECTION</h2>
<div class="outline-text-2" id="text-1">
<p>
Suppose that we want to find the <span class="underline">kth smallest key</span> in a list. In other words,
we want to know which item has index j if the list is sorted (where <code>j = k -
1</code>). We could simply sort the list, then look up the item at index j. But if we
don't actually need to sort the list, is there a faster way? This problem is
called <span class="underline">selection</span>.
</p>

<p>
One example is finding the median of a set of keys. In an array of n items, we
are looking for the item whose index is <code>j = floor(n / 2)</code> in the sorted list.
</p>
</div>
</div>

<div id="orgbdf5b5c" class="outline-2">
<h2 id="orgbdf5b5c"><span class="section-number-2">2</span> Quickselect</h2>
<div class="outline-text-2" id="text-2">
<p>
这里如果不用 quickselect，如果我用 heapsort 去做会如何？
</p>
<ol class="org-ol">
<li>heapsort 可以很快的取出最大最小值，so</li>
<li>如果要求 kth largest item from n elements</li>
<li>先初始化一个 heap, 耗时 n</li>
<li>然后取第一个最大值，rebalance heap 耗时 logn</li>
<li>执行上一步 k 次</li>
<li>总计 n + klogn</li>
</ol>
<pre class="example">
[扩展] 其实这里可以把最后复杂度变成：n + klogk
</pre>
<p>
The idea here is that somehow you're going to do this method so that your heap
instead of modifying a heap that has all the elements in it. You're modifying a
heap that has at most K elements in it, where k is biggest that you're looking
for.
</p>



<pre class="example">
如果采用 quicksort，先排序呢？
毫无疑问，更差一些，排序的时间是 nlogn
</pre>

<p>
We can modify quicksort to perform selection for us. Observe that when we choose
a pivot v and use it to partition the list into three lists I1, Iv, and I2, we
know which of the three lists contains index j, because we know the lengths of
I1 and I2. Therefore, we only need to search one of the three lists.
</p>

<p>
Here's the quickselect algorithm for finding the item at index j - that is,
having the (j + 1)th smallest key.
</p>

<pre class="example">
Start with an unsorted list I of n input items.
Choose a pivot item v from I.
Partition I into three unsorted lists I1, Iv, and I2.
  - I1 contains all items whose keys are smaller than v's key.
  - I2 contains all items whose keys are larger than v's.
  - Iv contains the pivot v.
  - Items with the same key as v can go into any of the three lists.
    (In list-based quickselect, they go into Iv; in array-based quickselect,
    they go into I1 and I2, just like in array-based quicksort.)
if (j &lt; |I1|) {
  Recursively find the item with index j in I1; return it.
} else if (j &lt; |I1| + |Iv|) {
  Return the pivot v.
} else {   // j &gt;= |I1| + |Iv|.
  Recursively find the item with index j - |I1| - |Iv| in I2; return it.
}
</pre>

<p>
[Attentation] If using <b>array-based quicksort</b>, and using this source code
QuickSortOnArray you should change <b>[|I1| with i, |Iv| with 1]</b>, 'i' is
defined in the src code.
</p>

<p>
The advantage of quickselect over quicksort is that we only have to make one
recursive call, instead of two. Since we make at most <span class="underline">one</span> recursive call at
<span class="underline">every</span> level of the recursion tree, quickselect is much faster than quicksort.
I won't analyze quickselect here, but it runs in Theta(n) average time if we
select pivots randomly.
</p>

<p>
We can easily modify the code for quicksort on arrays, presented in Lecture 31,
to do selection. The partitioning step is done exactly according to the Lecture
31 pseudocode for array quicksort. Recall that when the partitioning stage
finishes, the pivot is stored at index "i" (see the variable "i" in the array
quicksort pseudocode). In the quickselect pseudocode above, just replace <code>|I1|
with i and |Iv| with 1</code>.
</p>
</div>
</div>
