UCB_CS61_lec34.org
** A LOWER BOUND ON COMPARISON-BASED SORTING
Suppose we have a scrambled array of n numbers, with each number from 1...n
occurring once.  How many possible orders can the numbers be in?

#+BEGIN_EXAMPLE
The answer is n!, where n! = 1 * 2 * 3 * ... * (n-2) * (n-1) * n.
#+END_EXAMPLE

Here's why: the first number in the array can be anything from 1...n, yielding n
possibilities. Once the first number is chosen, the second number can be any one
of the remaining n-1 numbers, so there are n * (n-1) possible choices of the
first two numbers. The third number can be any one of the remaining n-2 numbers,
yielding n * (n-1) * (n-2) possibilities for the first three numbers. Continue
this reasoning to its logical conclusion.

Each different order is called a _permutation_ of the numbers, and there are n!
possible permutations.  (For Homework 9, you are asked to create a random
permutation of maze walls.)

#+BEGIN_EXAMPLE
Observe that if n > 0,
                                                                 n
  n! = 1 * 2 * ... * (n-1) * n <= n * n * n * ... * n * n * n = n

and (supposing n is even)
                                  n    n                                n/2
  n! = 1 * 2 * ... * (n-1) * n >= - * (- + 1) * ... * (n-1) * n >= (n/2)
                                  2    2
#+END_EXAMPLE

so n! is between $(n/2)^{ (n/2) }$ and $n^n$. Let's look at the logarithms of
both these numbers: ~log((n/2)^(n/2)) = (n/2) log (n/2)~, which is in Theta(n
log n), and ~log(n^n) = n log n~. Hence, ~log(n!)~ is also in Theta(n log n).

A _comparison-based_sort_ is one in which all decisions are based on comparing
keys (generally done by "if" statements). All actions taken by the sorting
algorithm are based on the results of a sequence of true/false questions. All of
the sorting algorithms we have studied are comparison-based.

Suppose that two computers run the _same_ sorting algorithm at the same time on
two _different_ inputs.  Suppose that every time one computer executes an "if"
statement and finds it true, the other computer executes the same "if"
statement and also finds it true; likewise, when one computer executes an "if"
and finds it false, so does the other.  Then both computers perform exactly the
same data movements (e.g. swapping the numbers at indices i and j) in exactly
the same order, so they both permute their inputs in _exactly_ the same way.

A correct sorting algorithm must generate a _different_ sequence of true/false
answers for each different permutation of 1...n, because it takes a different
sequence of data movements to sort each permutation. There are n! different
permutations, thus n! different sequences of true/false answers.

If a sorting algorithm asks d true/false questions, it generates <= 2^d
different sequences of true/false answers.  If it correctly sorts every
permutation of 1...n, then n! <= 2^d, so log_2 (n!) <= d, and d is in
Omega(n log n).  The algorithm spends Omega(d) time asking these d questions.
Hence,

#+BEGIN_EXAMPLE
 ==============================================================================
 EVERY comparison-based sorting algorithm takes Omega(n log n) worst-case time.
 ==============================================================================
#+END_EXAMPLE

This is an amazing claim, because it doesn't just analyze one algorithm. It says
that of the thousands of comparison-based sorting algorithms that haven't even
been invented yet, not one of them has any hope of beating O(n log n) time for
all inputs of length n. 
** LINEAR-TIME SORTING
However, there are faster sorting algorithms that can make q-way decisions for
large values of q, instead of true/false (2-way) decisions.  Some of these
algorithms run in linear time.

Comparison based algorithms(选/插/堆/快/并), is just '2-way' decisions. 下面介绍
的算法都是 'q-way' decisions

** Bucket Sort                                          :QWayDecision:Stable:
   Bucket Sort 适合使用 LinkedList 实现, 而Counting Sort 稍微更适合用 Array

_Bucket_sort_ works well when keys are distributed in a small range, e.g. from 0
to q - 1, and the number of items n is larger than, or nearly as large as q. In
other words, when q is in O(n).

- q: maximum key of items;
- n: number of items

  #+BEGIN_EXAMPLE
BucketSort or Counting Sort 对于键值 key 的最大值 or 范围有很苛刻的要求。
BucketSort or Counting Sort 更适合处理 items 的 key 的分布范围和 items 数量保持一致的数列。
比如，min(item.key) = 1; max(item.key)=100; ====> q = 100
     number(item) = 100;                   ====> n = 100
     q = O(n) BucketSort or Counting Sort
如果，min(item.key) = 1000; max(item.key) = 1100; ====> q = 1100
     number(item) = 100;                         ====> n = 100
     q >> n +BucketSort or Counting Sort + Redix Sort
  #+END_EXAMPLE


