UCB_CS61_lec34.html
<div id="org165e803" class="outline-2">
<h2 id="org165e803"><span class="section-number-2">3</span> A LOWER BOUND ON COMPARISON-BASED SORTING</h2>
<div class="outline-text-2" id="text-3">
<p>
Suppose we have a scrambled array of n numbers, with each number from 1&#x2026;n
occurring once.  How many possible orders can the numbers be in?
</p>

<pre class="example">
The answer is n!, where n! = 1 * 2 * 3 * ... * (n-2) * (n-1) * n.
</pre>

<p>
Here's why: the first number in the array can be anything from 1&#x2026;n, yielding n
possibilities. Once the first number is chosen, the second number can be any one
of the remaining n-1 numbers, so there are n * (n-1) possible choices of the
first two numbers. The third number can be any one of the remaining n-2 numbers,
yielding n * (n-1) * (n-2) possibilities for the first three numbers. Continue
this reasoning to its logical conclusion.
</p>

<p>
Each different order is called a <span class="underline">permutation</span> of the numbers, and there are n!
possible permutations.  (For Homework 9, you are asked to create a random
permutation of maze walls.)
</p>

<pre class="example">
Observe that if n &gt; 0,
                                                                 n
  n! = 1 * 2 * ... * (n-1) * n &lt;= n * n * n * ... * n * n * n = n

and (supposing n is even)
                                  n    n                                n/2
  n! = 1 * 2 * ... * (n-1) * n &gt;= - * (- + 1) * ... * (n-1) * n &gt;= (n/2)
                                  2    2
</pre>

<p>
so n! is between \((n/2)^{ (n/2) }\) and \(n^n\). Let's look at the logarithms of
both these numbers: <code>log((n/2)^(n/2)) = (n/2) log (n/2)</code>, which is in Theta(n
log n), and <code>log(n^n) = n log n</code>. Hence, <code>log(n!)</code> is also in Theta(n log n).
</p>

<p>
A <span class="underline">comparison-based_sort</span> is one in which all decisions are based on comparing
keys (generally done by "if" statements). All actions taken by the sorting
algorithm are based on the results of a sequence of true/false questions. All of
the sorting algorithms we have studied are comparison-based.
</p>

<p>
Suppose that two computers run the <span class="underline">same</span> sorting algorithm at the same time on
two <span class="underline">different</span> inputs.  Suppose that every time one computer executes an "if"
statement and finds it true, the other computer executes the same "if"
statement and also finds it true; likewise, when one computer executes an "if"
and finds it false, so does the other.  Then both computers perform exactly the
same data movements (e.g. swapping the numbers at indices i and j) in exactly
the same order, so they both permute their inputs in <span class="underline">exactly</span> the same way.
</p>

<p>
A correct sorting algorithm must generate a <span class="underline">different</span> sequence of true/false
answers for each different permutation of 1&#x2026;n, because it takes a different
sequence of data movements to sort each permutation. There are n! different
permutations, thus n! different sequences of true/false answers.
</p>

<p>
If a sorting algorithm asks d true/false questions, it generates &lt;= 2^d
different sequences of true/false answers.  If it correctly sorts every
permutation of 1&#x2026;n, then n! &lt;= 2^d, so log_2 (n!) &lt;= d, and d is in
Omega(n log n).  The algorithm spends Omega(d) time asking these d questions.
Hence,
</p>

<pre class="example">
==============================================================================
EVERY comparison-based sorting algorithm takes Omega(n log n) worst-case time.
==============================================================================
</pre>

<p>
This is an amazing claim, because it doesn't just analyze one algorithm. It says
that of the thousands of comparison-based sorting algorithms that haven't even
been invented yet, not one of them has any hope of beating O(n log n) time for
all inputs of length n. 
</p>
</div>
</div>
<div id="org69d8d92" class="outline-2">
<h2 id="org69d8d92"><span class="section-number-2">4</span> LINEAR-TIME SORTING</h2>
<div class="outline-text-2" id="text-4">
<p>
However, there are faster sorting algorithms that can make q-way decisions for
large values of q, instead of true/false (2-way) decisions.  Some of these
algorithms run in linear time.
</p>

<p>
Comparison based algorithms(选/插/堆/快/并), is just '2-way' decisions. 下面介绍的算法都是 'q-way' decisions
</p>
</div>
</div>

<div id="org0940d98" class="outline-2">
<h2 id="org0940d98"><span class="section-number-2">5</span> Bucket Sort&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QWayDecision">QWayDecision</span>&#xa0;<span class="Stable">Stable</span></span></h2>
<div class="outline-text-2" id="text-5">
<p>
Bucket Sort 适合使用 LinkedList 实现, 而Counting Sort 稍微更适合用 Array
</p>

<p>
<span class="underline">Bucket_sort</span> works well when keys are distributed in a small range, e.g. from 0
to q - 1, and the number of items n is larger than, or nearly as large as q. In
other words, when q is in O(n).
</p>

<ul class="org-ul">
<li>q: maximum key of items;</li>
<li><p>
n: number of items
</p>

<pre class="example">
BucketSort or Counting Sort 对于键值 key 的最大值 or 范围有很苛刻的要求。
BucketSort or Counting Sort 更适合处理 items 的 key 的分布范围和 items 数量保持一致的数列。
比如，min(item.key) = 1; max(item.key)=100; ====&gt; q = 100
     number(item) = 100;                   ====&gt; n = 100
     q = O(n) BucketSort or Counting Sort
如果，min(item.key) = 1000; max(item.key) = 1100; ====&gt; q = 1100
     number(item) = 100;                         ====&gt; n = 100
     q &gt;&gt; n +BucketSort or Counting Sort + Redix Sort
</pre></li>
</ul>
</div>
