UCB_CS61_lec34.org
*** Key number I goes into Queue number I.

We allocate an array of q queues (or singly-linked lists with tail references,
which are basically the same thing, but we only need the queue operations),
numbered from 0 to q - 1.  The queues are called _buckets_.  We walk through
the list of input items, and enqueue each item in the appropriate queue:
an item with key i goes into queue i.

Each item illustrated here has a numerical key and an associated value.

#+BEGIN_EXAMPLE
             -------------------------------------------------------------
       Input | 6:a | 7:b | 3:c | 0:d | 3:e | 1:f | 5:g | 0:h | 3:i | 7:j |
             -------------------------------------------------------------

                 0       1       2       3       4       5       6       7
             -----------------------------------------------------------------
Queue fronts |   .   |   .   |   *   |   .   |   *   |   .   |   .   |   .   |
             ----|-------|---------------|---------------|-------|-------|----
                 v       v               v               v       v       v
              ------- -------         -------         ------- ------- -------
              | 0:d | | 1:f |         | 3:c |         | 5:g | | 6:a | | 7:b |
              |  .  | |     |         |  .  |         |  *  | |  *  | |  .  |
              ---|--- -------         ---|---         ------- ------- ---|---
                 v       ^               v               ^       ^       v
              -------    |            -------            |       |    -------
              | 0:h |    |            | 3:e |            |       |    | 7:j |
              |  *  |    |            |  .  |            |       |    |  *  |
              -------    |            ---|---            |       |    -------
                 ^       |               v               |       |       ^
                 |       |            -------            |       |       |
                 |       |            | 3:i |            |       |       |
                 |       |            |  *  |            |       |       |
                 |       |            -------            |       |       |
                 |       |               ^               |       |       |
             ----|-------|---------------|---------------|-------|-------|----
Queue tails  |   .   |   .   |   *   |   .   |   *   |   .   |   .   |   .   |
             -----------------------------------------------------------------

#+END_EXAMPLE

When we're done, we concatenate all the queues together in order.

#+BEGIN_EXAMPLE
                 0       1       2       3       4       5       6       7
             -----------------------------------------------------------------
Queue fronts |   .   |   .   |   *   |   .   |   *   |   .   |   .   |   .   |
             ----|-------|---------------|---------------|-------|-------|----
                 v       v               v               v       v       v
              ------- -------         -------         ------- ------- -------
              | 0:d | | 1:f |         | 3:c |         | 5:g | | 6:a | | 7:b |
          ...>|  .  | |     |........>|  .  |      ..>|  *  |>|  *  |>|  .  |
              ---|--- -------         ---|---      :  ------- ------- ---|---
                 v       ^               v         :                     v
              -------    :            -------      :                  -------
              | 0:h |....:            | 3:e |      :                  | 7:j |
              |  *  |                 |  .  |      :                  |  *  |
              -------                 ---|---      :                  -------
                                         v         :
                                      -------      :
                                      | 3:i |.......
                                      |  *  |
                                      -------


Concatenated output:
------- ------- ------- ------- ------- ------- ------- ------- ------- -------
| 0:d |>| 0:h |>| 1:f |>| 3:c |>| 3:e |>| 3:i |>| 5:g |>| 6:a |>| 7:b |>| 7:j |
------- ------- ------- ------- ------- ------- ------- ------- ------- -------

#+END_EXAMPLE


This data structure is _exactly_ like a hash table (plus tail references), but
the hash code just maps the key i to bucket i, and there is no compression
function because there is no need for compression.

I just write a loop that walks through the buckets one by one and I always maintain
the tail of the last non-empty queue or the last item in the list so far and if I
hit an empty bucket I just don't do anything I skip over that bucket and I go on
to the next bucket and when I hit a bucket that's not empty, I take that queue and
I concatenate it to the end of the queue so far.

*** Running time of BucketSort
Bucket sort takes Theta(q + n) time--in the best case and in the worst case.
- It takes Theta(q) time to initialize the buckets in the beginning and to
  concatenate them together in the end.
- It takes Theta(n) time to put all the items in their buckets.

If q is in O(n)--that is, the number of possible keys isn't much larger than the
number of items we're sorting--then bucket sort takes Theta(n) time.

*** How did we get around the Omega(n log n) lower bound on comparison-based sorting?

_Bucket sort is not comparison-based_. We are making a _q-way decision_ every
time we decide which queue to put an item into, instead of the true/false
decisions provided by comparisons and "if" statements.

*** What is a Stable Sort
    Bucket sort (as I've described it here) is said to be _stable_.

    A sort is stable if items with equal keys come out in the same order they
    went in.

    For example, observe that 3:c, 3:e, and 3:i appear in the same
    order in the output above as they appeared in the input.

    _Bucket sort_ is not the only stable sort we have seen;
    _insertion sort_, _selection sort_, and _mergesort_ can all be implemented so
    that they are stable. The _linked list version of quicksort_ we have seen can
    be stable, but the array version is decidedly not. Heapsort is never
    stable. (Actually, we can _make_ heapsort stable using a simple trick
    called a _secondary_key_, which I might describe later in the semester.)
*** If q is in O(n), then BucketSort; else, RadixSort
Take note that bucket sort is ONLY appropriate when keys are distributed in
a small range; i.e. q is in O(n).  On Monday we'll study a sorting algorithm
called _radix_sort_ that will fix that limitation.  The stability of bucket
sort will be important for radix sort.

RadixSort use BucketSort as a subroutine and the _stablity_ of BucketSort is critical
to the success of RadixSort.
