UCB_CS61_lec34.html


<div id="org1037746" class="outline-3">
<h3 id="org1037746"><span class="section-number-3">5.1</span> Key number I goes into Queue number I.</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We allocate an array of q queues (or singly-linked lists with tail references,
which are basically the same thing, but we only need the queue operations),
numbered from 0 to q - 1.  The queues are called <span class="underline">buckets</span>.  We walk through
the list of input items, and enqueue each item in the appropriate queue:
an item with key i goes into queue i.
</p>

<p>
Each item illustrated here has a numerical key and an associated value.
</p>

<pre class="example">
             -------------------------------------------------------------
       Input | 6:a | 7:b | 3:c | 0:d | 3:e | 1:f | 5:g | 0:h | 3:i | 7:j |
             -------------------------------------------------------------

                 0       1       2       3       4       5       6       7
             -----------------------------------------------------------------
Queue fronts |   .   |   .   |   *   |   .   |   *   |   .   |   .   |   .   |
             ----|-------|---------------|---------------|-------|-------|----
                 v       v               v               v       v       v
              ------- -------         -------         ------- ------- -------
              | 0:d | | 1:f |         | 3:c |         | 5:g | | 6:a | | 7:b |
              |  .  | |     |         |  .  |         |  *  | |  *  | |  .  |
              ---|--- -------         ---|---         ------- ------- ---|---
                 v       ^               v               ^       ^       v
              -------    |            -------            |       |    -------
              | 0:h |    |            | 3:e |            |       |    | 7:j |
              |  *  |    |            |  .  |            |       |    |  *  |
              -------    |            ---|---            |       |    -------
                 ^       |               v               |       |       ^
                 |       |            -------            |       |       |
                 |       |            | 3:i |            |       |       |
                 |       |            |  *  |            |       |       |
                 |       |            -------            |       |       |
                 |       |               ^               |       |       |
             ----|-------|---------------|---------------|-------|-------|----
Queue tails  |   .   |   .   |   *   |   .   |   *   |   .   |   .   |   .   |
             -----------------------------------------------------------------

</pre>

<p>
When we're done, we concatenate all the queues together in order.
</p>

<pre class="example">
                 0       1       2       3       4       5       6       7
             -----------------------------------------------------------------
Queue fronts |   .   |   .   |   *   |   .   |   *   |   .   |   .   |   .   |
             ----|-------|---------------|---------------|-------|-------|----
                 v       v               v               v       v       v
              ------- -------         -------         ------- ------- -------
              | 0:d | | 1:f |         | 3:c |         | 5:g | | 6:a | | 7:b |
          ...&gt;|  .  | |     |........&gt;|  .  |      ..&gt;|  *  |&gt;|  *  |&gt;|  .  |
              ---|--- -------         ---|---      :  ------- ------- ---|---
                 v       ^               v         :                     v
              -------    :            -------      :                  -------
              | 0:h |....:            | 3:e |      :                  | 7:j |
              |  *  |                 |  .  |      :                  |  *  |
              -------                 ---|---      :                  -------
                                         v         :
                                      -------      :
                                      | 3:i |.......
                                      |  *  |
                                      -------


Concatenated output:
------- ------- ------- ------- ------- ------- ------- ------- ------- -------
| 0:d |&gt;| 0:h |&gt;| 1:f |&gt;| 3:c |&gt;| 3:e |&gt;| 3:i |&gt;| 5:g |&gt;| 6:a |&gt;| 7:b |&gt;| 7:j |
------- ------- ------- ------- ------- ------- ------- ------- ------- -------

</pre>


<p>
This data structure is <span class="underline">exactly</span> like a hash table (plus tail references), but
the hash code just maps the key i to bucket i, and there is no compression
function because there is no need for compression.
</p>

<p>
I just write a loop that walks through the buckets one by one and I always maintain
the tail of the last non-empty queue or the last item in the list so far and if I
hit an empty bucket I just don't do anything I skip over that bucket and I go on
to the next bucket and when I hit a bucket that's not empty, I take that queue and
I concatenate it to the end of the queue so far.
</p>
</div>
</div>

<div id="orgef4905f" class="outline-3">
<h3 id="orgef4905f"><span class="section-number-3">5.2</span> Running time of BucketSort</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Bucket sort takes Theta(q + n) time&#x2013;in the best case and in the worst case.
</p>
<ul class="org-ul">
<li>It takes Theta(q) time to initialize the buckets in the beginning and to
concatenate them together in the end.</li>
<li>It takes Theta(n) time to put all the items in their buckets.</li>
</ul>

<p>
If q is in O(n)&#x2013;that is, the number of possible keys isn't much larger than the
number of items we're sorting&#x2013;then bucket sort takes Theta(n) time.
</p>
</div>
</div>

<div id="org08a60a5" class="outline-3">
<h3 id="org08a60a5"><span class="section-number-3">5.3</span> How did we get around the Omega(n log n) lower bound on comparison-based sorting?</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<span class="underline">Bucket sort is not comparison-based</span>. We are making a <span class="underline">q-way decision</span> every
time we decide which queue to put an item into, instead of the true/false
decisions provided by comparisons and "if" statements.
</p>
</div>
</div>

<div id="orgc9c1d73" class="outline-3">
<h3 id="orgc9c1d73"><span class="section-number-3">5.4</span> What is a Stable Sort</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Bucket sort (as I've described it here) is said to be <span class="underline">stable</span>.
</p>

<p>
A sort is stable if items with equal keys come out in the same order they
went in.
</p>

<p>
For example, observe that 3:c, 3:e, and 3:i appear in the same
order in the output above as they appeared in the input.
</p>

<p>
<span class="underline">Bucket sort</span> is not the only stable sort we have seen;
<span class="underline">insertion sort</span>, <span class="underline">selection sort</span>, and <span class="underline">mergesort</span> can all be implemented so
that they are stable. The <span class="underline">linked list version of quicksort</span> we have seen can
be stable, but the array version is decidedly not. Heapsort is never
stable. (Actually, we can <span class="underline">make</span> heapsort stable using a simple trick
called a <span class="underline">secondary_key</span>, which I might describe later in the semester.)
</p>
</div>
</div>
<div id="org1c27c1e" class="outline-3">
<h3 id="org1c27c1e"><span class="section-number-3">5.5</span> If q is in O(n), then BucketSort; else, RadixSort</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Take note that bucket sort is ONLY appropriate when keys are distributed in
a small range; i.e. q is in O(n).  On Monday we'll study a sorting algorithm
called <span class="underline">radix_sort</span> that will fix that limitation.  The stability of bucket
sort will be important for radix sort.
</p>

<p>
RadixSort use BucketSort as a subroutine and the <span class="underline">stablity</span> of BucketSort is critical
to the success of RadixSort.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
